Repository: 84000/data-translation-memory
Catalog: toh338-v4.tmx
Source language: bo
Languages: en

source: །བཞོན་པ་བྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering a vehicle?

source: རྐང་པ་ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པར་འགྱུར་བ་དང་། རྐང་པ་ཤིན་ཏུ་གནས་པར་འགྱུར་བ་དང་། རྐང་པས་འགྲོ་བ་ན་ལུས་ངལ་བར་མི་འགྱུར་བ་དང་། བདེ་བར་འགྱུར་བ་དང་། མི་མཛའ་བ་མང་བར་མི་འགྱུར་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྒྱ་ཆེན་པོ་འཐོབ་པར་འགྱུར་བ་དང་། བཞོན་པ་རྣམས་ཀྱིས་བྲེལ་བར་མི་འགྱུར་བ་དང་། རིམ་གྲོ་བྱེད་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: One’s feet will always be youthful; one will be surefooted; when walking, the body will not get tired; one will be happy; one will not have many enemies; one will obtain the excellent four bases of magic powers; one will never be short of a means of transportation; one will have servants; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་བཞོན་པ་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a vehicle. “

source: །གནས་བྱིན་པའི་ཕན་ཡོན་ནི་རབ་ཏུ་མང་སྟེ། མང་པོ་གང་ཞེ་ན།
en: The blessings of giving shelter are many. What are they?

source: དེ་ལ་འཇིགས་པ་མི་འབྱུང་ངོ་། །གདིང་བ་དང་བགོ་བ་ཤིན་ཏུ་འཇམ་པོ་རྙེད་པར་འགྱུར་རོ། །ལྷ་དང་མི་རྣམས་ཀྱི་འདོད་པའི་ཡོན་ཏན་ལྔ་རྙེད་པར་འགྱུར་རོ།
en: The one who gives shelter will be fearless; one will obtain very soft mats and clothes; and one will obtain the five objects of sensual pleasures of gods and humans.

source: །གལ་ཏེ་འདོད་དེ་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེའམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་འམ། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན། དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: If someone should wish, ‘May I be born into a family of a great and exalted royal lineage,’ or ‘May I be born into a family of a great and exalted brahmin lineage,’ or ‘May I be born into a family of a great and exalted householder lineage,’ then this wish will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ་བདག་གྲོང་གི་གཙོ་བོར་གྱུར་ཅིག་ཅེའམ། གྲོང་ཁྱེར་གྱི་གཙོ་བོར་གྱུར་ཅིག་ཅེ་འམ། གྲོང་རྡལ་གྱི་གཙོ་བོར་གྱུར་ཅིག་ཅེའམ། རི་བྲགས་ཀྱི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེ་འམ། རྒྱལ་ཕྲན་དུ་གྱུར་ཅིག་ཅེའམ། རྒྱལ་པོ་བཙན་པར་གྱུར་ཅིག་ཅེ་ན། དེའི་སྨོན་ལམ་དེ་བཞིན་དུ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I become the chief of a village,’ or ‘May I become the chief of a town,’ or ‘May I become the chief of a large city,’ or ‘May I become chieftain of a remote border-city,’ or ‘May I become ruler of a vassal kingdom,’ or ‘May I become a powerful monarch,’ then this wish will be fulfilled accordingly.

source: །གལ་ཏེ་འདོད་དེ་གླིང་གཅིག་པའི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེའམ། གླིང་གཉིས་ཀྱི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེ་འམ། གླིང་གསུམ་གྱི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེའམ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཅིག་ཅེ་ན། དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I become the sovereign of one continent,’ or ‘May I become the sovereign of two continents,’ or ‘May I become the sovereign of three continents,’ or ‘May I become a wheel-turning monarch,’ then one’s wish will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I be born having equal status with the devas belonging to the retinue of the Four Great Kings,’ then this wish will be fulfilled.

source: །སུམ་ཅུ་རྩ་གསུམ་དང་། འཐབ་བྲལ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Or, the wish ‘May I be born having equal status with the devas of the Heaven of the Thirty-Three, the devas of the Yāma class, the devas of the Heaven of Joy, the devas of the Heaven of Delighting in Emanations, and the devas of the Heaven of Mastery over Others’ Emanations’ will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། བདག་ཚངས་རིགས་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ། །ཚངས་པའི་མདུན་ན་འདོན་དང་། ཚངས་ཆེན་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་དང་། དགེ་ཆུང་དང་། ཚད་མེད་དགེ་དང་། དགེ་རྒྱས་དང་། སྤྲིན་མེད་དང་། བསོད་ནམས་སྐྱེས་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་དང་། ཤིན་ཏུ་མཐོང་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I be born having equal status with devas belonging to Brahmā’s Retinue,’ then this wish will be fulfilled. Or, the wish ‘May I be born having equal status with the devas of the heavens called Brahmā’s Ministers, Great Brahmās, Limited Radiance, Boundless Radiance, Luminous Radiance, Limited Virtue, Boundless Virtue, Perfect Virtue, Cloudless, Abundance of Merit, Great Fruit, None Greater, Sorrowless, Beautiful, Delightful Appearance, and those of the Highest Heaven” will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I be born having equal status with the devas belonging to the Sphere of Infinity of Space, the Sphere of Infinity of Consciousness, the Sphere of Nothingness, and the Sphere of Neither Perception nor Nonperception,’ then this wish will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱའོ་ཞེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I attain the fruit of becoming a stream enterer,’ then this wish will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་དང་བྱང་ཆུབ་མངོན་དུ་བྱའོ་ཞེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་རོ།
en: Should one wish, ‘May I attain the fruit of becoming a once-returner, a non-returner, and an arhat, and may I attain the awakening of a pratyekabuddha,’ then this wish will be fulfilled.

source: །གལ་ཏེ་འདོད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་གྱུར་ཅིག་ཅེ་ན་ཡང་དེའི་སྨོན་པ་དེ་འགྲུབ་པར་འགྱུར་ཏེ།
en: Should one wish, ‘May I completely awaken to the unsurpassed completely perfect awakening,’ then this wish will be fulfilled.

source: །མང་པོ་དེ་དག་ནི་གནས་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the many blessings of offering shelter. “

source: །བཏུང་བ་བྱིན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of offering a beverage?

source: དབང་པོ་ཐམས་ཅད་ཡོངས་སུ་ཚང་བར་འགྱུར་བ་དང་། དཔྲལ་བ་དག་ཅིང་འཛུམ་པའི་བཞིན་དུ་འགྱུར་བ་དང་། ཡོན་ཏན་དང་ལྡན་པར་འགྱུར་བ་དང་། སེམས་ཀྱི་རྒྱུད་མཉེན་པར་འགྱུར་བ་དང་། སྐོམ་པར་མི་འགྱུར་བ་དང་། སྐོམ་ན་ཡང་ཆུ་འབྱུང་བར་འགྱུར་བ་དང་། ཡི་དགས་སུ་སྐྱེ་བར་མི་འགྱུར་བ་དང་། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: All one’s sense faculties will be complete; one will have a bright forehead, and one’s face will be as if always smiling; one will be endowed with merit; one’s mindstream will be supple; one will not suffer thirst; even when thirsty, water will appear; one will not be reborn as a ghost; one will have great prosperity; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: བཅུ་པོ་དེ་དག་ནི་བཏུང་བ་བྱིན་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of offering a beverage. “

source: །རབ་ཏུ་བྱུང་བའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of monastic renunciation?

source: དེ་བུ་དང་ཆུང་མ་དང་ནོར་ལ་སྲེད་པར་མི་འགྱུར་བ་དང་། དེ་འདོད་པའི་ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་བ་དང་། དགོན་པར་གནས་པ་ལ་དགའ་བ་དང་། སངས་རྒྱས་ལ་གུས་པར་འགྱུར་བ་དང་། བདུད་ཀྱི་སྤྱོད་ཡུལ་རྣམ་པར་སྤོང་བ་དང་། བདེ་འགྲོ་ཐོབ་པར་བྱེད་པའི་ཆོས་རྣམས་ཡོངས་སུ་ཚོལ་བ་དང་། ངན་འགྲོ་འཐོབ་པར་བྱེད་པའི་ཆོས་རྣམས་སྤོང་བ་དང་། ལྷ་དང་མིར་སྨོན་པ་མེད་པ་དང་། རྟག་ཏུ་དེ་བཞིན་གཤེགས་པའི་གསུང་རབ་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་བ་དང་། མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བ་དང་། མྱུར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟེ།
en: The one who renounces will not hanker after offspring, a spouse, or riches; one will not be in the grip of desire; one will delight in living in a forest as a recluse; one will be devoted to the Buddha; one will avoid the realm of Māra; one will thoroughly strive for those qualities that cause one to obtain the happy, higher realms of existence and avoid those qualities that cause one to fall into the lower realms of existence; one will desire nothing, either from gods or from humans; one will always become a nun or monk in the Buddha’s teaching; one will be reborn in heaven; and one will quickly attain complete nirvāṇa.

source: ཆོས་བཅུ་པོ་དེ་དག་ནི་རབ་ཏུ་བྱུང་བའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of monastic renunciation. “

source: །དགོན་པ་ལ་གནས་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of retreating to the forest life?

source: འདུ་འཛི་རྣམ་པར་སྤོང་བ་དང་། རབ་ཏུ་དབེན་པ་ལ་སྟེན་པ་དང་། དེའི་སེམས་བསམ་གཏན་ལ་དམིགས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་སྨོན་པ་དང་། དགའ་བ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་ལུས་ལ་སྐྱེད་པ་དང་། དེ་ལ་བར་དུ་གཅོད་པར་མི་འགྱུར་བ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱི་དོན་རྒྱ་ཆེར་ཤེས་པར་འགྱུར་བ་དང་། ཞི་གནས་འཐོབ་པ་དང་། ལྷག་མཐོང་ཐོབ་པ་སྟེ།
en: One will leave behind society; one will resort to strict seclusion; one’s mind will focus on contemplation; one will aspire to the state of the buddha-bhagavāns; joy, happiness and gladness will arise in the body; obstacles will not occur; one will develop full understanding of the meaning of the Dharma as one has received it; one will reach calm abiding; and one will reach insight.

source: བཅུ་པོ་དེ་དག་ནི་དགོན་པ་ལ་གནས་པའི་ཕན་ཡོན་ནོ།
en: These are the ten blessings of retreating to the forest life. “

source: །བསོད་སྙོམས་ལེན་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of living on alms?

source: དེ་འགྲོ་བ་ལ་གོམས་པར་འགྱུར་བ་དང་། དེ་སྤྱོད་ཡུལ་ལ་གོམས་པར་འགྱུར་བ་དང་། ང་རྒྱལ་བཅག་པར་འགྱུར་བ་དང་། བདག་རྙེད་པ་ལ་སྦྱོར་བ་དང་། གཞན་དག་ཀྱང་བསོད་ནམས་ལ་རབ་ཏུ་འགོད་པ་དང་། སྟོན་པའི་བསྟན་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཕྱི་མའི་སྐྱེ་བོ་ལ་སྣང་བར་བྱས་པར་འགྱུར་བ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཉམ་ང་བ་མེད་པར་བྱས་པར་འགྱུར་བ་དང་། དམའ་བའི་སེམས་ཉེ་བར་གཞག་པར་འགྱུར་བ་དང་། བསོད་སྙོམས་ཀྱིས་ཡོངས་སུ་དུལ་བའི་དགེ་སྦྱོང་གི་ཕྱོགས་ལ་མུན་པ་མེད་པར་སྣང་བའོ།
en: One will become accustomed to walking; one will become familiar with one’s alms round; one’s arrogance will be cut off; one applies oneself purposefully for one’s gain; one will firmly establish others in virtue; one will elucidate the teachings of the Buddha; one will make them shine for future generations; one will not cause harm for one’s companions in the holy life; one will establish a humble attitude; and for the well-disciplined ascetic, alms will manifest without obstruction. “

source: །འཇིགས་པ་མེད་པའི་ཕན་ཡོན་བཅུ་ཡོད་དེ། བཅུ་གང་ཞེ་ན།
en: What are the ten blessings of the ten kinds of confidence?

source: འཇིགས་པ་མེད་པར་གྲོང་དུ་འཇུག་པ་དང་། འཇིགས་པ་མེད་པར་གྲོང་ནས་འབྱུང་བ་དང་། འཇིགས་པ་མེད་པར་ཁྱིམ་རྣམས་སུ་འགྲོ་བ་དང་། འཇིགས་པ་མེད་པར་འཁོར་རྣམས་ལ་ཆོས་སྟོན་པ་དང་། འཇིགས་པ་མེད་པར་དགེ་འདུན་གྱི་ནང་དུ་འཇུག་པ་དང་། འཇིགས་པ་མེད་པར་སློབ་དཔོན་དང་མཁན་པོའི་དྲུང་དུ་འགྲོ་བ་དང་། འཇིགས་པ་མེད་པར་བྱམས་པའི་སེམས་ཀྱིས་སློབ་མའི་གན་དུ་འགྲོ་བ་དང་། འཇིགས་པ་མེད་པར་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཡོངས་སུ་སྤྱོད་པ་དང་། འཇིགས་པ་མེད་པར་ཁ་ཏོན་འདོན་པ་དང་། འཇིགས་པ་མེད་པར་ཚེ་འཕོ་བའི་དུས་བྱེད་པའོ།
en: With confidence one enters a village; with confidence one leaves the village; with confidence one enters into homes; with confidence one teaches the Dharma in an assembly; with confidence one appears among the saṅgha; with confidence one approaches one’s preceptor and teacher; with confidence one approaches one’s disciples with kind thoughts; with confidence one uses one’s permitted possessions: robes, begging bowl, bedding, and medicine to cure illnesses; with confidence one loudly performs one’s recitations; and with confidence one passes away at the time of death. “

source: །བྲམ་ཟེའི་ཁྱེའུ་དེ་ལྟར་ན། སེམས་ཅན་རྣམས་ནི་བདག་གི་ལས་ལས་གྱུར་པ། ལས་ཀྱི་རྒྱུ་ལས་སྐྱེས་པ། ལས་ཀྱི་སྐལ་བ་ལ་སྤྱོད་པ། ལས་ལ་རྟེན་པ་ཡིན་ཏེ། སེམས་ཅན་རྣམས་ནི་ལས་ཀྱིས་རབ་དང་། འབྲིང་དང་། ཐ་མར་རྣམ་པར་ཕྱེ་བའོ་ཞེས་ངས་གང་སྨྲས་པ་དེ་ནི་འདི་ལས་དགོངས་ཏེ་སྨྲས་སོ།
en: Brahmin youth, it is like this: beings are owners of their own actions, they originate from their actions, they are heirs of their actions, and they take action as their refuge. Beings are divided into high, middle, and low by their actions. From now on, honor what I have said!”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན། བྲམ་ཟེའི་ཁྱེའུ་ཤུ་ཀ་བཅོམ་ལྡན་འདས་ལ་སེམས་མངོན་པར་དད་དོ། །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Buddha had finished this discourse on Dharma, the brahmin youth Śuka developed faith in the Bhagavān and said,

source: གཽ་ཏ་མ་ཁྱོད་མཉན་དུ་ཡོད་པར། དགེ་བསྙེན་གཞན་དག་གི་ཁྱིམ་དུ་གཤེགས་པར་དགོངས་ན། བདག་གི་ཕ་བྲམ་ཟེ་ཏོའུ་དེ་ཡའི་ཁྱིམ་དུ་ཡང་གཤེགས་པར་དགོངས་སུ་གསོལ།
en: “Gautama, when you intend to go to the houses of other lay people in Śrāvastī, I beg you to consider also going to the house of my father, the brahmin Taudeya.

source: དེ་ནི་བྲམ་ཟེ་ཏོའུ་དེ་ཡའི་ཁྱིམ་དུ་ཡུན་རིང་པོའི་དོན་དུ་བདེ་བ་དང་ཕན་པར་འགྱུར་རོ།
en: This will lead to happiness and benefit in the house of the brahmin Taudeya for a long time.”

source: །བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས། བྲམ་ཟེའི་ཁྱེའུ་ཤུ་ཀ་ལ་གནང་བ་མཛད་དོ།
en: By remaining silent, the Bhagavān consented to the brahmin youth Śuka’s request.

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཤུ་ཀས། བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ།
en: Then, when the brahmin youth Śuka recognized that the Bhagavān had consented through silence, he was delighted about the Bhagavān’s teachings.

source: རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གན་ནས་སོང་ངོ་།
en: Having rejoiced, he departed from the Bhagavān. “

source: །ལས་རྣམ་པར་འབྱེད་པ་རྫོགས་སོ།།
en: The Exposition of Karma” is complete.
